# ResList_PropFilter

## Description
Sets the filter for the resource properties. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
PROCEDURE ResList_PropFilter(
				uniqueID : STRING;
				callback : PROCEDURE);
```

```python
def vs.ResList_PropFilter(uniqueID, callback):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING|   |
|callback|PROCEDURE|   |

## Version
Availability: from Vectorworks 2020

## Category
* Document List Handling